# main.py
from config import Config
from core.voice_assistant import VoiceAssistant


def main():
    """Главная функция запуска ассистента"""

    # Создание конфигурации
    config = Config()

    # Создание ассистента
    assistant = VoiceAssistant(config)
    """
    # Примеры тестирования (раскомментируй нужное)
    # Тест 1: Время (ключевое слово + контекст)
    assistant.next_prompt("сколько сейчас времени", use_voice=False)

    print("\n" + "=" * 50 + "\n")

    # Тест 2: Ложное срабатывание (должно НЕ сработать)
    assistant.next_prompt("у меня на сегодня запланирована дата", use_voice=False)

    print("\n" + "=" * 50 + "\n")

    # Тест 3: Семантика без ключевых слов
    assistant.next_prompt("какое сегодня число", use_voice=False)
    print("\n" + "=" * 50 + "\n")

    assistant.next_prompt("подскажика пожалуйста сколько сейчас времечка", use_voice=False)
    print("\n" + "=" * 50 + "\n")

    # Тест обычного вопроса
    assistant.next_prompt("как дела", use_voice=False)
    print("\n" + "=" * 50 + "\n")


    """
    """
    assistant.next_prompt("сколько будет два плюс 2", use_voice=False)
    print("\n" + "=" * 50 + "\n")

    assistant.next_prompt("сколько будет два плюс четыре", use_voice=False)
    print("\n" + "=" * 50 + "\n")

    """

    """
    assistant.next_prompt("Сколько будет 15*3, потом результат раздели на 5", use_voice=False)
    print("\n" + "=" * 50 + "\n")

    assistant.next_prompt(
        "Сколько будет четыреста пятьдесят семь умножить на пятнадцать, разделить на три, разделить на тридцать",
        use_voice=False)
    print("\n" + "=" * 50 + "\n")

    # assistant.next_prompt("Тело массой 5 кг тянут силой 18 Н по горизонтали, сила трения равна 3 Н — найди его ускорение.", use_voice=False)
    print("\n" + "=" * 50 + "\n")

    # assistant.next_prompt("привет как дела", use_voice=False)
    print("\n" + "=" * 50 + "\n")

    assistant.next_prompt("Привет меня зовут Максим", use_voice=False)
    print("\n" + "=" * 50 + "\n")

    assistant.next_prompt("забудь что меня зовут максим", use_voice=False)
    print("\n" + "=" * 50 + "\n")

    assistant.next_prompt("сколько сейчас времени", use_voice=False)

    print("\n" + "=" * 50 + "\n")
    assistant.next_prompt("подскажика пожалуйста сколько сейчас времечка", use_voice=False)
    """

    print("\n" + "=" * 50 + "\n")
    # Тестирование текстом
    print("\n" + "=" * 50 + "\n")
    assistant.next_prompt("Hello, how are you?", use_voice=False)
    print("\n" + "=" * 50 + "\n")
    assistant.next_prompt("Привет, как дела?", use_voice=False)
    print("\n" + "=" * 50 + "\n")
    assistant.next_prompt("Bonjour, comment ça va?", use_voice=False)
    print("\n" + "=" * 50 + "\n")
    assistant.next_prompt("你好，你好吗？", use_voice=False)
    print("\n" + "=" * 50 + "\n")

    print("🧠 проверка завершена")

    # Запуск голосового цикла (раскомментируй для использования)
    # assistant.run_voice_loop()


if __name__ == "__main__":
    main()
